% Горин Никита, М8О-213Б-22
% Номер по списку 5
% Вариант 5

% Удаление элемента
myremove(X, [X|T], T).
myremove(X, [H|T1], [H|T2]) :-
  myremove(X, T1, T2).

% Перестановка элементов
mypermute([], []).
mypermute(X, [H|T1]) :-
  myremove(H, X, T),
  mypermute(T, T1).
%------------------------------------------
solve(P,L,K,S) :-
    mypermute([P,L,K,S], [1, 2, 3, 4]),
    not(contradiction([P,L,K,S])), !.
%------------------------------------------
contradiction([P,L,K,S]) :-
    not(( % утверждение болельщика 1
    (P \= 1, K == 4); P == 1
    )).

contradiction([P,L,K,S]) :-
    not(( % утверждение болельщика 2
    ((K == 3, P == 4); K \= 3),
    P < S
    )).

contradiction([P,L,K,S]) :-
    not(( % утверждение болельщика 3
    ((L \= 1, P == 3); L == 1),
    ((K == 2, S \= 4); K \= 2)
    )).

contradiction([P,L,K,S]) :-
    not(( % утверждение болельщика 4
    ((K == 1, S == 2); K \= 1),
    ((S \= 2, L \= 2); S == 2)
    )).
%-----------------------------------------

